package com.imooc.coupon.service.impl;

/**
 * @Annotation
 * @ClassName jianli
 * @Author ChenWenJie
 * @Data 2020/6/1 2:08 下午
 * @Version 1.0
 **/
public class jianli {


    /**
     * 项目介绍
     *   本系统主要是为了方便医院科研项目的审批、评审、科研预算的发放和科研经费的支出，以及各个科室的科研绩效管理。
     *   主要模块有
     *      论文管理、指南发布、指南申报、课题管理、专家评审、经费管理、成果管理、科研绩效管理等，
     *      其中各个模块都实现了模块直接添加和开启审批添加的方式，各个环节实现企业微信推送功能，
     *      专家评审是院内或院外专家，对课题的评审，经费管理则是对课题的预算进行编制和对预算经费的支出操作，
     *      成果则是围绕论文和课题产生出来的成果数据，绩效是对不同群组设置不同数量的课题年度考核计划，
     *      以及各个群组实时的课题、论文数据进行统计以报表和列表形式展示也有与亿信BI的对接，
     *      公司是中台方式进行开发的，其中门户、用户、组织、权限、流程都是调用的中台
     *  责任描述：
     *    负责整个项目的后端任务分配和部分模块研发，负责的开发模块有 专家评审、经费管理、科研绩效这三个模块的后端开发工作
     * 技术栈：
     *        服务端：springCloud，eureka，Zuul，feign，Hystrix springDataJPA redis kafka mysql
     *        前端：    React
     */
}
